lidDrivenCavity/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.5971914124998499;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform 1.5971914124998499;
    }
    fixedWalls
    {
        type            omegaWallFunction;
        value           uniform 1.5971914124998499;
    }
    frontAndBack
    {
        type            empty;
    }
}