lidDrivenCavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       fsppFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           600;

deltaT            0.0001;

maxDeltaT         1;

adjustTimeStep    yes;

maxCo             50.0;

writeControl      adjustableRunTime;

writeInterval     10.0;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

functions
{
    #include "include/lineProbes"
    #include "include/yPlus"
    #include "include/residuals"
}

// ************************************************************************* //
