lidDrivenCavity/system/include/forceCoefficients
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      forceCoefficiens;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forceCoeffs
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (fixedWalls);
    rho             rhoInf;
    rhoInf          1.0;
    liftDir         (-0.0 1.0 0);
    dragDir         (1.0 0.0 0);
    CofR            (0.25 0 0);
    pitchAxis       (0 0 1);
    magUInf         1.0;
    lRef            1.0;
    Aref            1.0;
}

// ************************************************************************* //
