lidDrivenCavity/system/include/lineProbes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampling;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uy
{
    type                  sets;
    libs                  (sampling);

    interpolationScheme   cellPoint;

    setFormat             raw;

    writeControl    writeTime;

    log                   no;

    sets
    (
        Uy
        {
            type          uniform;
            axis          xyz;
            start         (0.5 1 0.05);
            end           (0.5 0 0.05);
            nPoints       100;
        }
    );

    fields
    (
        U
    );
}

Vx
{
    type                  sets;
    libs                  (sampling);

    interpolationScheme   cellPoint;

    setFormat             raw;

    writeControl    writeTime;

    log                   no;

    sets
    (
        Vx
        {
            type          uniform;
            axis          xyz;
            start         (1 0.5 0.05);
            end           (0 0.5 0.05);
            nPoints       100;
        }
    );

    fields
    (
        U
    );
}

// ************************************************************************* //
